{
  "backend/main.mo": "Motoko canister implementing user profiles, categories, and articles with admin/user authorization and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping high-level features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light/dark modes and global background/text settings.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for public and admin pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that checks authentication and admin permissions before rendering admin pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/layout/CategoryNav.tsx": "Navigation component fetching and displaying news categories with skeleton loading states.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, social links, and a Caffeine.ai attribution link including dynamic year and hostname.",
  "frontend/src/components/layout/Header.tsx": "Provides the site header with logo, category navigation, login/admin controls, and a responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a header, footer, and main content area using a full-height flex layout.",
  "frontend/src/components/news/ArticleCard.tsx": "Displays a clickable article preview card showing image, category, date, title, excerpt, and author.",
  "frontend/src/components/news/ArticleListToolbar.tsx": "Offers search input and sort selector controls for filtering and ordering article lists.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for checking admin status and managing the caller’s user profile through the backend actor.",
  "frontend/src/hooks/useArticle.ts": "Fetches a single article by ID using the current backend actor.",
  "frontend/src/hooks/useArticles.ts": "Supplies hooks for fetching, creating, updating, and deleting articles with automatic cache invalidation.",
  "frontend/src/hooks/useCategories.ts": "Provides hooks to list, create, update, and delete categories while managing related query caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, exposing identity state, login/logout, and related status tracking.",
  "frontend/src/index.css": "Defines Tailwind base layers, color variables, dark mode values, and typography defaults for the site.",
  "frontend/src/lib/utils.ts": "Contains utility helpers for merging class names and formatting bigint timestamps into readable dates.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/admin/AdminArticlesPage.tsx": "Admin interface for creating, editing, and deleting articles with a dialog form and table view.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for managing categories, including creation, editing, and deletion via a dialog and table.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Wraps admin pages with navigation links for articles and categories.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article with category, metadata, image, and full content, handling loading and error states.",
  "frontend/src/pages/CategoryPage.tsx": "Shows articles filtered by category with search and sort options, handling loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Lists all articles with search and sorting, showing a hero banner and handling loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, theme extensions (colors, fonts, animations), custom container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project state, including features, requirements, pending requests, and image asset needs for the Sanukhabar news portal."
}